app/views/applies/_form.html.erb

    <%= f.label :Id_Entidad %>
    <%= f.select :Id_Entidad,  options_from_collection_for_select(Entity.all, :Id_Entidad, :Nombre) %>
---
SELECT `entities`.* FROM `entities`

    <%= f.label :Id_Impuesto %>
    <%= f.select :Id_Impuesto,  options_from_collection_for_select(Tax.all, :Id_Impuesto, :NombreImpuesto) %>
---
SELECT `taxes`.* FROM `taxes`