app/views/entities/_form.html.erb

    <%= f.label :Id_Usuario %>
    <%= f.select :Id_Usuario,  options_from_collection_for_select(User.all, :id, :nombre_completo) %>
---
SELECT `users`.* FROM `users`