app/views/users/new.html.erb

      <%= f.label :role %>
      <%= f.select :role,  options_from_collection_for_select(Role.all, :Id_Rol, :NombreRol) %>
---
SELECT `roles`.* FROM `roles`