app/views/users/show.html.erb

SELECT `users`.* FROM `users`
---
<div class="col-sm-12">
	<% User.all.collect do |user| %>