app/views/clients/_form.html.erb

    <%= f.label :Id_Entidad %>
    <%= f.select :Id_Entidad,  options_from_collection_for_select(Entity.where(:Id_Usuario => session[:user_id]), :Id_Entidad, :Nombre) %>
---
SELECT `entities`.* FROM `entities` WHERE `entities`.`Id_Usuario` = 2