app/views/retains/_form.html.erb

SELECT `bills`.* FROM `bills`
---
    <%= f.label :Id_Factura %>
    <%= f.select :Id_Factura,  options_from_collection_for_select(Bill.all, :Id_Factura, :Id_Factura) %>

SELECT `retentions`.* FROM `retentions`
---
    <%= f.label :Id_Retencion %>
    <%= f.select :Id_Retencion,  options_from_collection_for_select(Retention.all, :Id_Retencion, :Id_Retencion) %>