app/views/bills/_form.html.erb

    <%= f.label :Id_Entidad %>
    <%= f.select :Id_Entidad,  options_from_collection_for_select(Entity.all, :Id_Entidad, :Nombre) %>
---
SELECT `entities`.* FROM `entities`