app/views/bills/_form.html.erb

    <%= f.label :Id_Entidad %>
    <%= f.collection_select :Id_Entidad, Entity.order(:Nombre), :Id_Entidad, :Nombre, include_blank: true %>
---
SELECT `entities`.* FROM `entities` ORDER BY `entities`.`Nombre` ASC

    <%= f.label :Id_Cliente %>
    <%= f.grouped_collection_select :Id_Cliente, Entity.order(:Nombre), :clients, :Nombre, :Id_Cliente, :Nombre, include_blank: true %>
---
SELECT `clients`.* FROM `clients` ORDER BY `clients`.`Nombre` ASC