app/controllers/applies_controller.rb

  def index
    @applies = Apply.all
---
SELECT `applies`.* FROM `applies`

  def create
    @apply = Apply.new(apply_params)

    respond_to do |format|
      if @apply.save
---
INSERT INTO `applies` (`Id_Entidad`, `Id_Impuesto`, `created_at`, `updated_at`) VALUES (1, 1, '2017-04-17 03:45:42', '2017-04-17 03:45:42')