app/controllers/bills_controller.rb

SELECT `bills`.* FROM `bills`
---
  def index
    @bills = Bill.all

INSERT INTO `bills` (`Id_Entidad`, `Id_Cliente`, `NumeroFactura`, `FechaEmision`, `EmitidaRecibida`, `IncluyeIva`, `Descuento`, `created_at`, `updated_at`) VALUES (2, 3, '045', '2014-02-25', 1, 1, 0.0, '2017-04-17 02:12:57', '2017-04-17 02:12:57')
---
  def create
    @bill = Bill.new(bill_params)

    respond_to do |format|
      if @bill.save