app/controllers/clients_controller.rb

SELECT `clients`.* FROM `clients`
---
  def index
    @clients = Client.all

INSERT INTO `clients` (`Id_Entidad`, `Identificacion`, `Nombre`, `Telefono`, `Direccion`, `Email`, `created_at`, `updated_at`) VALUES (1, '1792207673', 'Raul Almeida', '09965956142', 'Angamarca', 'raul.almeida@hotmail.com', '2017-04-19 02:07:41', '2017-04-19 02:07:41')
---
  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save