app/controllers/details_controller.rb

  def index
    @details = Detail.all
---
SELECT `details`.* FROM `details`

  def create
    @detail = Detail.new(detail_params)

    respond_to do |format|
      if @detail.save
---
INSERT INTO `details` (`Id_Factura`, `Descripcion`, `ValorUnitario`, `Cantidad`, `created_at`, `updated_at`) VALUES (1, 'Computadora', 1524.62, 3, '2017-04-17 02:18:57', '2017-04-17 02:18:57')