app/controllers/entities_controller.rb

SELECT `entities`.* FROM `entities` WHERE `entities`.`Id_Usuario` = 2
---
  def index
    @entities = Entity.where(:Id_Usuario => session[:user_id])

INSERT INTO `entities` (`Id_Usuario`, `Identificacion`, `Nombre`, `Telefono`, `Direccion`, `Email`, `created_at`, `updated_at`) VALUES (1, '1718947706001', 'Martin y Asociados', '0996543240', 'De los Carrisos N3-449', 'martin.almeida@udla.edu.ec', '2017-04-17 00:40:08', '2017-04-17 00:40:08')
---
  def create
    @entity = Entity.new(entity_params)

    respond_to do |format|
      if @entity.save

UPDATE `entities` SET `Id_Usuario` = 1, `Nombre` = 'Entidad 123', `Direccion` = '6 de Diciembre', `Email` = 'entidady@dominio123.com', `updated_at` = '2017-04-17 17:58:19' WHERE `entities`.`Id_Entidad` = 4
---
  def update
    respond_to do |format|
      if @entity.update(entity_params)