app/controllers/entities_controller.rb

SELECT `entities`.* FROM `entities`
---
  def index
    @entities = Entity.all