app/controllers/retains_controller.rb

SELECT `retains`.* FROM `retains`
---
  def index
    @retains = Retain.all

INSERT INTO `retains` (`Id_Factura`, `Id_Retencion`, `PorcentajeRetencion`, `created_at`, `updated_at`) VALUES (1, 2, 2.0, '2017-04-17 02:30:17', '2017-04-17 02:30:17')
---
  def create
    @retain = Retain.new(retain_params)

    respond_to do |format|
      if @retain.save