app/controllers/retentions_controller.rb

  def index
    @retentions = Retention.all
---
SELECT `retentions`.* FROM `retentions`

  def create
    @retention = Retention.new(retention_params)

    respond_to do |format|
      if @retention.save
---
INSERT INTO `retentions` (`NumeroRetencion`, `created_at`, `updated_at`) VALUES ('54', '2017-04-17 02:25:45', '2017-04-17 02:25:45')