app/controllers/roles_controller.rb

SELECT `roles`.* FROM `roles`
---
  def index
    @roles = Role.all

INSERT INTO `roles` (`NombreRol`, `created_at`, `updated_at`) VALUES ('admin', '2017-04-18 22:00:48', '2017-04-18 22:00:48')
---
  def create
    @role = Role.new(role_params)

    respond_to do |format|
      if @role.save