app/controllers/taxes_controller.rb

  def index
    @taxes = Tax.all
---
SELECT `taxes`.* FROM `taxes`

  def create
    @tax = Tax.new(tax_params)

    respond_to do |format|
      if @tax.save
---
INSERT INTO `taxes` (`NombreImpuesto`, `PorcentajeImpuesto`, `created_at`, `updated_at`) VALUES ('IVA', 14.0, '2017-04-17 01:41:45', '2017-04-17 01:41:45')