app/controllers/users_controller.rb

	def create
		@user = User.new(allowed_params)
		@user.role = 2
		if @user.save
---
INSERT INTO `users` (`email`, `password_digest`, `created_at`, `updated_at`, `name`, `lastname`, `username`, `role`) VALUES ('martin.ameida@udla.edu.ec', '$2a$10$474VCnq8MsLUg/.2BFRcweu.hWAsyB6nEXCNOYs7ugp5T9PGeQ2OC', '2017-04-18 22:05:36', '2017-04-18 22:05:36', 'Martin', 'Almeida', 'martintpvt', 1)