app/views/details/_form.html.erb

    <%= f.label :Id_Factura %>
    <%= f.select :Id_Factura,  options_from_collection_for_select(Bill.all, :Id_Factura, :Id_Factura) %>
---
SELECT `bills`.* FROM `bills`